// --- ข้อมูลตั้งต้นสำหรับภาควิชา ---
export const initialDepartments = [
    { "id": 1, "name": "ภาควิชาครุศาสตร์อุตสาหกรรม" },
    { "id": 2, "name": "ภาควิชาครุศาสตร์สถาปัตยกรรมและการออกแบบ" },
    { "id": 3, "name": "ภาควิชาครุศาสตร์วิศวกรรม" },
    { "id": 4, "name": "ภาควิชาครุศาสตร์เกษตร" }
];

// --- ข้อมูลตั้งต้นสำหรับหลักสูตร ---
export const initialPrograms = [
    { "id": 1, "name": "วท.ม. การศึกษาวิทยาศาสตร์และเทคโนโลยี", "degree": "ปริญญาโท", "departmentId": 1 },
    { "id": 2, "name": "ค.อ.ม. นวัตกรรมและการวิจัยเพื่อการเรียนรู้", "degree": "ปริญญาโท", "departmentId": 1 },
    { "id": 3, "name": "ค.อ.ม. การบริหารการศึกษา", "degree": "ปริญญาโท", "departmentId": 1 },
    { "id": 4, "name": "ค.อ.ด. นวัตกรรมและการวิจัยเพื่อการเรียนรู้", "degree": "ปริญญาเอก", "departmentId": 1 },
    { "id": 5, "name": "ค.อ.ด. การบริหารการศึกษา", "degree": "ปริญญาเอก", "departmentId": 1 },
    { "id": 6, "name": "ค.อ.ม. เทคโนโลยีการออกแบบผลิตภัณฑ์อุตสาหกรรม", "degree": "ปริญญาโท", "departmentId": 2 },
    { "id": 7, "name": "ปร.ด. สาขาวิชาเทคโนโลยีการออกแบบผลิตภัณฑ์อุตสาหกรรม", "degree": "ปริญญาเอก", "departmentId": 2 },
    { "id": 8, "name": "วท.ม. คอมพิวเตอร์ศึกษา", "degree": "ปริญญาโท", "departmentId": 3 },
    { "id": 9, "name": "ค.อ.ม. วิศวกรรมไฟฟ้าสื่อสาร", "degree": "ปริญญาโท", "departmentId": 3 },
    { "id": 10, "name": "ปร.ด. คอมพิวเตอร์ศึกษา", "degree": "ปริญญาเอก", "departmentId": 3 },
    { "id": 11, "name": "ปร.ด. วิศวกรรมไฟฟ้าศึกษา", "degree": "ปริญญาเอก", "departmentId": 3 },
    { "id": 12, "name": "วท.ม. การศึกษาเกษตร", "degree": "ปริญญาโท", "departmentId": 4 },
    { "id": 13, "name": "ปร.ด. การศึกษาเกษตร", "degree": "ปริญญาเอก", "departmentId": 4 }
];